In [1]:
import os
import numpy as np 
import pandas as pd

# 1.) Using MySQL.Connector to MySQLWorkbench
    - Connect to MySQL
    - Print Database Information 
    - Select Schemas(Database)
    - Disconnect from MySQL

Reference: https://dev.mysql.com/doc/connector-python/en/

In [2]:
import mysql.connector
from mysql.connector import Error

<img src="/Users/chen-lichiang/Desktop/SQL/Module/Example of Connection.png" alt="Getting started" width="600" height="400"/>

In [3]:
try:
    # Connect to MySQL
    connection = mysql.connector.connect(
        host='127.0.0.1',          # Host Name
        database='sql_tutorial',   # Schemas in MySQL a.k.a Database
        user='root',               # Username
        password='****')           # Password when connect to MySQL

    if connection.is_connected():

        # Print current database version
        db_Info = connection.get_server_info()
        print("Database information：", db_Info)

        # Print current selected database
        cursor = connection.cursor()
        cursor.execute("SELECT DATABASE();")
        record = cursor.fetchone()
        print("Current Selected Database：", record)

except Error as e:
    print("Connection file：", e)

finally:
    if (connection.is_connected()):
        cursor.close()
        connection.close()
        print("Disconnect to Databse",db_Info)

Database information： 8.0.25
Current Selected Database： ('sql_tutorial',)
Disconnect to Databse 8.0.25

# 2.) mysql.connector select data

In [20]:
connection = mysql.connector.connect(
        host='127.0.0.1',          # Host Name
        database='sql_tutorial',   # Schemas in MySQL a.k.a Database
        user='root',               # Username
        password='****')     # Password when connect to MySQL

cursor = connection.cursor()

cursor.execute("SELECT * FROM student;") # use sql in execute() function.
cursor.fetchall() # Print all Datapoint.

[(1, '小子', '英語', 20),
 (2, '小光', '英語', 30),
 (3, '小志', '化學', 40),
 (4, '小綠', '英語', 90),
 (5, '小美', '英語', 60),
 (6, '小美', '化學', 60)]

- using pandas to read sql data

In [29]:
student_sql_df = pd.read_sql_query("SELECT * FROM student;",connection)
student_sql_df

   student_id name major  score
0           1   小子    英語     20
1           2   小光    英語     30
2           3   小志    化學     40
3           4   小綠    英語     90
4           5   小美    英語     60
5           6   小美    化學     60

- Select certain type using SQL

In [30]:
cursor.execute("SELECT name, score FROM student;")
for (name, score) in cursor:
        print("Name: %s, Score: %d" % (name, score))

Name: 小子, Score: 20
Name: 小光, Score: 30
Name: 小志, Score: 40
Name: 小綠, Score: 90
Name: 小美, Score: 60
Name: 小美, Score: 60

# 3.) Update and Drop data in sql.connector

In [33]:
sql = "UPDATE student SET `major` = '英語文學' WHERE `major` = '英語';"
cursor = connection.cursor()
cursor.execute(sql)

student_sql_df = pd.read_sql_query("SELECT * FROM student;",connection)
student_sql_df

   student_id name major  score
0           1   小子  英語文學     20
1           2   小光  英語文學     30
2           3   小志    化學     40
3           4   小綠  英語文學     90
4           5   小美  英語文學     60
5           6   小美    化學     60

- we can point out that '英語' has been transformed to '英語文學'

- delete certain row data in sql

In [35]:
sql = "DELETE FROM student WHERE `score` < 30;"
cursor = connection.cursor()
cursor.execute(sql)

student_sql_df = pd.read_sql_query("SELECT * FROM student;",connection)
student_sql_df

   student_id name major  score
0           2   小光  英語文學     30
1           3   小志    化學     40
2           4   小綠  英語文學     90
3           5   小美  英語文學     60
4           6   小美    化學     60

# 4.) Disconnect from MySQLworkbench

In [36]:
if (connection.is_connected()):
    cursor.close()
    connection.close()